app/controllers/books_controller.rb

INSERT INTO "books" ("author", "created_at", "name", "resensi", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?)  [["author", "Ganteng"], ["created_at", Sat, 27 Dec 2014 07:31:15 UTC +00:00], ["name", "Anlisis Sistem"], ["resensi", "banget"], ["updated_at", Sat, 27 Dec 2014 07:31:15 UTC +00:00], ["year", 1992]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save